/******************************************************************
*  文件名称：
*        clock.c
* 文件说明：
*     通过实验，熟悉如何设置系统主时钟(MCLK)、辅助时钟(ACLK)、
*      子系统时钟(SMCLK)
*      程序运行后可以得到ACLK＝32768、MCLK＝SMCLK＝32768*10
*
******************************************************************/

#include <MSP43014x.h>

/*****************************************************************
*     main（）函数
*****************************************************************/

void main(void)
{
    WDTCTL   = WDTPW + WDTHOLD; // 关闭看门狗
    P1DIR    = 0x32;            // 设置 P1.1,P1.4,P1.5 方向
    P1SEL    = 0x32;            // P1.1,P1.4,P1.5 为外围模块
    FLL_CTL1 = FLL_DIV0;        // 设置 p1.5 输出频率
                                // 设置 FLL_CTL1 = 0x32;
    SCFQCTL  =0x09;             // 设置 SMCLK = ACLK * 10
                                // 设置 MCLK = ACLK * 10
    while(1);                   //空循环，供用户检测其输出频率

}

