/*
 ----------------------------------------------------
 *作    者：温子祺
 ----------------------------------------------------
 */

#include "stc.h"           //加载stc.h头文件

unsigned char i=0;         //声明变量i

/****************************************
*函数名称:main
*输    入:无
*输    出:无
*功    能:函数主体
******************************************/
void main(void)              
{

	TH0=(65536-50000)/256; //计数寄存器高8位
	TL0=(65536-50000)%256; //计数寄存器低8位
	TMOD=0x01;                //工作方式为16位定时器
	ET0=0x01;                 //允许T/C0中断
	EA=1;                      //开启全局中断
    TR0=1;                     // 启动T/C0运行

	while(1)                   // 进入死循环
	{
		if(i>7)i=0;            //若i>7,则i=0
    } 
}
/****************************************
*函数名称:Timer0IRQ
*输    入:无
*输    出:无
*功    能:T/C0中断服务函数
******************************************/
void Timer0IRQ(void) interrupt 1 //中断服务函数
{
	TH0=(65536-50000)/256;      //计数寄存器高8位重新载入
	TL0=(65536-50000)%256;      //计数寄存器低8位重新载入
	P2=1<<i;                    //进入位移操作,熄灭相对应位的LED
    i++;                        //i自加1
}

