/*
 ----------------------------------------------------
 *作    者：温子祺
 ----------------------------------------------------
 */
#include "stc.h"
#include "global.h"
#include "UARTHardware.h"
#include "UARTInterface.h"
/******************************************************************
*函数名称:UARTHwInit
*输    入:无
*输    出:无
*说    明:串口 硬件层初始化
*******************************************************************/
void UARTHwInit(void)
{
  	SCON=0x40;
	T2CON=0x34;
	RCAP2L=0xD9;
	RCAP2H=0xFF;
	REN=1;


}
/******************************************************************
*函数名称:UARTIRQ
*输    入:无
*输    出:无
*说    明:串口 中断服务程序
*******************************************************************/
void UARTIRQ(void) interrupt 4
{
	if(RI)
	{
		RI=0;

	}


}
