#ifndef __UARTINTERFACE_H__
#define __UARTINTERFACE_H__

/******************************************************************
*函数名称:UARTInit
*输    入:无
*输    出:无
*说    明:串口 初始化
*******************************************************************/
extern void UARTCiInit(void) ;
/******************************************************************
*函数名称:UARTCiPrintfString
*输    入:b
*输    出:无
*说    明:串口 发送字符串
*******************************************************************/
extern void UARTCiPrintfString(const INT8 *str);
/******************************************************************
*函数名称:UARTCiPrintfVal
*输    入:b
*输    出:无
*说    明:串口 发送单字节
*******************************************************************/
extern void UARTCiPrintfVal(UINT8 *str,UINT32 val,UINT8 show);
/***********************************************************************************
** 函数名称 	: UARTCiSetRxResponse
** 功能描述 	: UART 接收响应设置
** 输		入	:	 无
** 输		出	:    无
************************************************************************************/
extern void UARTCiSetRxResponse(void);
/***********************************************************************************
** 函数名称 	: UARTCiGetRxResponse
** 功能描述 	: UART 接收响应获取
** 输		入	:	 无
** 输		出	:    无
************************************************************************************/
extern BOOL UARTCiGetRxResponse(void);









#endif