/*****************************************************
*  LCD 模块
*****************************************************/
#ifndef MSP430F449_H
#include <msp430x44x.h>
#endif

#define LCD_IN_USE 8
#define RADIX_POINT 0x08
/******************************************************
   数据定义                                        
*****************************************************/
const unsigned char NUM_LCD[16]={ 
                0x7B, 0x12, 0x4f, 0x1f, 0x36,  //'0'~ '4'
		0x3d, 0x7d, 0x13, 0x7f, 0x3f,  //'5' ~ '9'
		0x73, 0x7c, 0x69, 0x5e, 0x6f,  // '6'~ 'E'
		0x65};                         // F"
unsigned char lcd_Buf[LCD_IN_USE];             // 自定义显示缓冲区，用于
                                               // 外部设定要显示的数据 
/*******************************************************
*     模块初始化
*******************************************************/
void init_LCD(void){
    char tmpv;
    BTCTL |= 0x10;                         // set LCD 时钟
    P3DIR  = 0xff;                         // 输出模式
    P5SEL  = 0xfc;                         // 置为外围模块
    LCDCTL = LCDON+LCD4MUX+LCDP1;          // 4Mux 模式
    
     for (tmpv = 0;tmpv<7;tmpv++){
        LCDMEM[tmpv] = 0x00;               //clear LCD
    }
    LCDMEM[7] = 0x02;                      // 设置LCDMEM[7]             
   
   
}
/****************************************************
* 
*    更新LCD缓冲区的内容，把数据显示到LCD
*     
****************************************************/
void lcd_Display(){                      
    
    char tmpv;
    for(tmpv=0;tmpv<LCD_IN_USE-1;tmpv++)
    {   //更新LCDMEM中的内容
        LCDMEM[tmpv] = NUM_LCD[lcd_Buf[tmpv]];  
    }
     
}
/***************************************************
*  设置小数点
***************************************************/
void lcd_SetRP(){
    LCDMEM[2] |= 0x80; 
}
