/*
 ----------------------------------------------------
 *作    者：温子祺
 ----------------------------------------------------
 */
#include "stc.h"
#include "global.h"
#include "USBHardware.h"
#include "USBInterface.h"
/***********************************************************************************
** 函数名称 : USBHwInit
** 功能描述 : USB 硬件初始化
** 输	 入	: 无
** 输	出	: 无
************************************************************************************/
void USBHwInit(void)
{
	 IT0=0; //低电平触发
	 EX0=1; //允许外部中断0

}

/*
  ---------------------  USB 中断服务程序  ---------------------
*/

/***********************************************************************************
** 函数名称 : USBHwIRQ
** 功能描述 : 中断服务程序
** 输	 入	: 无
** 输	出	: 无
************************************************************************************/
void USBHwIRQ(void) interrupt 0
{
	 ENTER_CRITICAL();                       //关全局中断，即EA=0

	 SYSPostCurMsg(RUN_USB_DISPOSE_DATA);    //发送消息

     EXIT_CRITICAL();                        //开全局中断，即EA=1

}
