//========================================================================================================
// 文件名称：system.asm
// 实现功能：实现与硬件相关的底层操作
// 日    期：2003/7/7
//========================================================================================================
.INCLUDE   hardware.inc
.CODE
//========================================================================================================
//函数: F_System_Initial
//语法：void F_System_Initial()
//描述：初始化
//参数：无
//返回：无
//========================================================================================================
.PUBLIC _F_System_Initial;
_F_System_Initial: .PROC
	PUSH r1,r1 TO [sp];
	r1=0xFFFF;
	[P_IOA_Dir]=r1;
	[P_IOA_Attrib]=r1;
	r1=0xFFFF;
	[P_IOA_Data]=r1;
	POP r1,r1 FROM [sp];
	RETF;
	.ENDP;
	
.PUBLIC _F_LED_On;
_F_LED_On: .PROC 
	PUSH r1,r1 TO [sp];
	bp=sp+1;
	r1=[bp+3];
	[P_IOA_Data]=r1;
	POP r1,r1 FROM [sp];
	RETF;
	.ENDP
