////////////////////////汇诚科技////////////////////
//////////////////http://www.ourhc.cn///////////////
///////////////////直流电机正转调试程序/////////////

#include<reg52.h> 

unsigned int s,i,j,k,z;

sbit P2_0=P2^0;//启动
sbit P2_1=P2^1;//启动
sbit P2_2=P2^2;//停止
sbit P2_3=P2^3;//停止

void delay(i)//延时函数
  {
      for(j=0;j<i;j++)
      for(k=0;k<9600;k++);
  }


main()
{
i=60;  //改变此值的大小就可以改变正反转时间的长短
if(P2_0==0)//启动
      {
while(1)
         {
	  
	  P1=0X55;
	  delay(i);
	  P1=0Xaa;
	  delay(i);

          }

      }
}