//========================================================================================================
// 文件名称：system.asm
// 实现功能：实现与硬件相关的底层操作
// 日    期：2003/7/7
//========================================================================================================

.INCLUDE hardware.inc;
.CODE
//**************************************************************************************************************
// 函数: F_System_Initial
// 语法：void F_System_Initial(void) (for c language)
// 功能：用于初始化
// 入口：无
// 出口：无
//**************************************************************************************************************
.PUBLIC _F_System_Initial;
_F_System_Initial: .PROC
	PUSH r1 TO [sp];
    r1 = 0xFFF0;             		//IOA8-IOA15 接SRAM的数据线，初始化为高电平输出
    [P_IOA_Dir] = r1;        		//IOA4--IOA7 接SRAM控制线，设置为同相高电平输出
    [P_IOA_Attrib] = r1;     
    r1 = 0xFFF0; 
    [P_IOA_Data] = r1;       
    
    r1 = 0xFFFF ;            		//设置IOB口为同相输出
    [P_IOA_Dir] = r1;        		//
    [P_IOA_Attrib] = r1;     
    r1 = 0x0000;
    [P_IOA_Data] = r1;  
    POP r1 FROM [SP];
	RETF;
	.ENDP;
//**************************************************************************************************************
// 函数: F_Clear_WatchDog
// 语法：void F_Clear_WatchDog(void) (for c language)
// 功能：用于清看门狗
// 入口：无
// 出口：无
//**************************************************************************************************************
.PUBLIC _F_Clear_WatchDog;
_F_Clear_WatchDog: .PROC
	PUSH r1 TO [sp];
	r1=0x0001;
	[P_Watchdog_Clear]=r1;
	POP r1 FROM [sp];
	RETF
	.ENDP