/*
 ----------------------------------------------------
 *作    者：温子祺
 ----------------------------------------------------
 */
#ifndef __NETINTERFACE_H__
#define __NETINTERFACE_H__
/******************************************************************
*函数名称:NETCiWriteOp
*输    入:op 命令,addr 地址, dat 数据
*输    出:无
*说    明:网络模块写操作
*******************************************************************/
extern void NETCiWriteOp(UINT8 op,  //命令
                UINT8 addr,//地址
                UINT8 dat  //数据
                ) ;
/******************************************************************
*函数名称:NETCiReadOp
*输    入:op 命令,addr 地址
*输    出:无
*说    明:网络模块读操作
*******************************************************************/ 
extern UINT8 NETCiReadOp (UINT8 op,  //命令
                 UINT8 addr//地址
                );
/******************************************************************
*函数名称:NETCiReadBuffer
*输    入:len 长度 ,data 保存的数据
*输    出:无
*说    明:网络模块读连续的数据
*******************************************************************/
extern void NETCiReadBuffer(UINT16 len,  //长度
                   UINT8 *buf  //数据
                   );	
/******************************************************************
*函数名称:NETCiWriteBuffer
*输    入:len 长度 ,buf 要发送的数据
*输    出:无
*说    明:网络模块写连续的数据
*******************************************************************/
extern void NETCiWriteBuffer(UINT16 len, //长度
                             UINT8 *buf //数据
                    );
/******************************************************************
*函数名称:NETCiSetBank
*输    入:addr 地址
*输    出:无
*说    明:
*******************************************************************/
extern void NETCiSetBank(UINT8 addr);
/******************************************************************
*函数名称:NETCiRead
*输    入:addr 地址
*输    出:一字节数据
*说    明:从某一个地址读取1字节数据
*******************************************************************/     
extern UINT8 NETCiRead(UINT8 addr);
/******************************************************************
*函数名称:NETCiClkOut
*输    入:clk 时钟
*输    出:无
*说    明:NET 时钟输出
*******************************************************************/     
extern void NETCiClkOut(UINT8 clk);
/******************************************************************
*函数名称:NETCiWrite
*输    入:addr 地址  dat 数据
*输    出:无
*说    明:从某一个地址写入1字节数据
*******************************************************************/ 
extern void NETCiWrite(UINT8 addr,
              UINT8 dat);
/******************************************************************
*函数名称:NETCiPhyWrite
*输    入:addr 地址, dat 16位数据
*输    出:无
*说    明:设置PHY
*******************************************************************/
extern void NETCiPhyWrite(UINT8  addr, 
                 UINT16 dat);			  
/******************************************************************
*函数名称:NETCiInit
*输    入:mac 地址
*输    出:无
*说    明:网络设备初始化
*******************************************************************/
extern void NETCiInit(UINT8 *mac);			  
			  									   			 
/******************************************************************
*函数名称:NETCiPacketSend
*输    入:pDestAddr 目标IP地址
          txdnet    网络
          buffer_length 长度
          packet_type  数据包类型 
*输    出:无
*说    明:网络设备发送数据
*******************************************************************/
extern void NETCiPacketSend(UINT8 *packet,UINT16 len);
/******************************************************************
*函数名称:NETCiPacketReceive
*输    入:rxdnet    网络
*输    出:长度
*说    明:网络设备接收数据
*******************************************************************/
extern UINT16 NETCiPacketReceive(UINT8 *packet,UINT16 maxlen);






#endif
