#ifndef __NETPROTOCOL_H__
#define __NETPROTOCOL_H__
/******************************************************************
*函数名称:NETPcCheckSum
*输    入:buf  数据
          len  长度
          type 协议类型 
*输    出:UINT16 数据
*说    明:校验和
*******************************************************************/ 
extern UINT16 NETPcCheckSum(UINT8 *buf, UINT16 len,UINT8 type);
/******************************************************************
*函数名称:NETPcInit
*输    入:mymac mac地址
          myip  ip地址
          port  端口 
*输    出:无
*说    明:TCP初始化
*******************************************************************/ 
extern void NETPcInit(UINT8 *mymac,UINT8 *myip,UINT16 port);
/******************************************************************
*函数名称:NETPcEthIsArpAndMyIp
*输    入:buf 网络接收的数据
          len 长度
*输    出:0/1
*说    明:检查以太网的ARP和本机IP地址是否正确
*******************************************************************/ 
extern UINT8 NETPcEthIsArpAndMyIp(UINT8 *buf,UINT16 len);
/******************************************************************
*函数名称:NETPcEthIsIpAndMyIp
*输    入:buf 网络接收的数据
          len 长度
*输    出:0/1
*说    明:检查以太网的IP和本机IP地址是否正确
*******************************************************************/ 
extern UINT8 NETPcEthIsIpAndMyIp(UINT8 *buf,UINT16 len);
/******************************************************************
*函数名称:NETPcMakeEth
*输    入:buf 本机向网络发送的数据
*输    出:无
*说    明:制作以太网帧头部 这里操作是填充MAC地址
*******************************************************************/ 
extern void NETPcMakeEth(UINT8 *buf);
/******************************************************************
*函数名称:NETPcFillIPHdrChkSum
*输    入:buf 本机向网络发送的数据
*输    出:无
*说    明:填充IP头部的校验和
*******************************************************************/ 
extern void NETPcFillIPHdrChkSum(UINT8 *buf);
/******************************************************************
*函数名称:NETPcMakeIP
*输    入:buf 本机向网络发送的数据
*输    出:无
*说    明:填充IP头部的数据 如目标地址 源地址
*******************************************************************/ 
extern void NETPcMakeIP(UINT8 *buf);
/******************************************************************
*函数名称:NETPcMakeTcpHead
*输    入:buf          本机向网络发送的数据
          rel_ack_num  应答回复
          mss          是否将TCP首部增加最大4个字节长度
          cp_seq       是否复制seq数据
*输    出:无
*说    明:填充TCP头部的数据 
*******************************************************************/ 
extern void NETPcMakeTcpHead(UINT8 *buf,UINT16 rel_ack_num,UINT8 mss,UINT8 cp_seq);
/******************************************************************
*函数名称:NETPcMakeArpAnswer
*输    入:buf          本机向网络发送的数据
          rel_ack_num  应答回复
          mss          是否将TCP首部增加最大4个字节长度
          cp_seq       是否复制seq数据
*输    出:无
*说    明:填充TCP头部的数据 
*******************************************************************/
extern void NETPcMakeArpAnswer(UINT8 *buf);
/******************************************************************
*函数名称:NETPcMakeEchoReply
*输    入:buf  本机向网络发送的数据
          len  长度       
*输    出:无
*说    明:填充ICMP要应答的数据
*******************************************************************/
extern void NETPcMakeEchoReply(UINT8 *buf,UINT16 len);
/******************************************************************
*函数名称:NETPcMakeUdpReply
*输    入:buf  本机向网络发送的数据
          data 要添加的数据
		  data 添加的数据的长度
		  port 端口      
*输    出:无
*说    明:填充UDP要应答的数据
*******************************************************************/
extern void NETPcMakeUdpReply(UINT8 *buf,UINT8 *sz,UINT8 datalen,UINT16 port);
/******************************************************************
*函数名称:NETPcMakeTcpSynAck
*输    入:buf  本机向网络发送的数据    
*输    出:无
*说    明:填充TCP要应答的数据
*******************************************************************/
extern void NETPcMakeTcpSynAck(UINT8 *buf);
/******************************************************************
*函数名称:NETPcGetTcpDataPointer
*输    入:无
*输    出:无
*说    明:获取TCP数据的位置
*******************************************************************/
extern UINT16 NETPcGetTcpDataPointer(void);
/******************************************************************
*函数名称:NETPcInitLenInfo
*输    入:buf  本机向网络发送的数据
*输    出:无
*说    明:初始化用到的关于数据长度的变量
*******************************************************************/
extern void NETPcInitLenInfo(UINT8 *buf);
/******************************************************************
*函数名称:NETPcMakeTcpAck
*输    入:buf  本机向网络发送的数据
          bfin 本机是否主动断开链接
*输    出:无
*说    明:填充TCP应答信息
*******************************************************************/
extern void NETPcMakeTcpAck(UINT8 *buf,BOOL bfin);
/******************************************************************
*函数名称:NETPcMakeTcpAckWithData
*输    入:buf  本机向网络发送的数据
          dlen 发送数据的长度
*输    出:无
*说    明:填充TCP应答信息和数据
*******************************************************************/
extern void NETPcMakeTcpAckWithData(UINT8 *buf,UINT16 dlen);

#endif