#ifndef __UARTINTERFACE_H__
#define __UARTINTERFACE_H__

/******************************************************************
*函数名称:UARTInit
*输    入:无
*输    出:无
*说    明:串口 初始化
*******************************************************************/
extern void UARTCiInit(UINT16 baud) ;
/******************************************************************
*函数名称:UARTCiSendByte
*输    入:b
*输    出:无
*说    明:串口 发送多字节
*******************************************************************/
extern void UARTCiSendNBytes(UINT8 *buf,UINT8 len);
/******************************************************************
*函数名称:UARTCiPrintfString
*输    入:b
*输    出:无
*说    明:串口 发送字符串
*******************************************************************/
extern void UARTCiPrintfString(INT8 *str);
/******************************************************************
*函数名称:UARTCiPrintfVal
*输    入:b
*输    出:无
*说    明:串口 发送单字节
*******************************************************************/
extern void UARTCiPrintfVal( INT8 *str,UINT32 val,UINT8 show);










#endif
