/*
 ----------------------------------------------------
 *作    者：温子祺
 ----------------------------------------------------
 */
#include "stc.h"
#include "global.h"

//16进制数表格
CODE INT8 HexTable[16]={'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};
/*************************************************************
* 函数名称:DelayNus
* 输    入:t 延时时间
* 输    出:无
* 说    明:毫秒级延时
**************************************************************/
void DelayNus(UINT16 t)
{
	do
	{
		NOP();
	}while(--t >0);	
}
/*************************************************************
* 函数名称:BufCpy
* 输    入:dest 缓冲区; size 缓冲区大小
* 输    出:无
* 说    明:清空缓冲区
**************************************************************/
BOOL BufCpy(UINT8 * dest,UINT8 * src,UINT32 size)
{
    
	do
	{
		*dest++ = *src++;
		
	}while(--size!=0);
	
	return TRUE;
} 
/*************************************************************
* 函数名称:itoa
* 输    入:val 数值
           str 字符串
           DecOrHex 进制
* 输    出:无
* 说    明:数值变为字符串
**************************************************************/ 
void itoa(UINT32 val,UINT8 *str,UINT8 DecOrHex)
{
     UINT8 i;
     UINT8 buf[10];


     if(10 == DecOrHex)
     {
         for(i=0; i<10 ;i++)
         {
             buf[9-i]=(UINT8)('0'+val%10);   
             val/=10;   
         } 
     
         
         for(i=0;i<=9;)
         {
             if('0' == buf[i])
             {
                 i++;
             }
             else
             {
                break;
             }
         }

         BufCpy(str,&buf[i],10-i);  
                   
     }
     
     if(16 == DecOrHex)
     {
        *str++='0';
	    *str++='x';
	    
        i=28;
        
        while(i)
        {
            if(0  == ((val>>i) &0x0f))
            {   
                i=i-4;
               
            }
            else
            {
                break;
            }
        } 
        
        while(1)
        {
            *str++=(HexTable[(val>>i) &0x0f]); 
            
            if(i<=0)
            {
                break; 
            }     
                    
            i=i-4;
        }  
        
     } 


}
