//*****************************************************************************/
// 描述： 通过点亮不同发光二极管来显示B口输出的不同数值。
// 日期： 2003/07/08
// 版本： 1.8.0
//*****************************************************************************/

.INCLUDE hardware.inc;			    //包含IO的头文件
.RAM
.VAR G_LedCounter;				    //定义变量保存LED显示值
.VAR G_DelayCounter;			    //定义延时的计数变量
.CODE
.PUBLIC _main;
//=============================================================================================== 
// 函数： main()
// 描述：主函数
//============================================================================================						
_main:                              
	R1 = 0xFFFF;			
	[P_IOB_Dir] = R1;			    //设置B口为同相输出口
	[P_IOB_Attrib] = R1;		
	R1 = 0x0000;						
	[P_IOB_Data] = R1;		
	[G_LedCounter] = R1;		    //保存计数器值
L_MainLoop:  
	R1 = [G_LedCounter];	
	[P_IOB_Data] = R1;			    //送计数器值到B口
	R1 = [G_LedCounter];	        //计数器加1 
	R1 += 1;					
	[G_LedCounter] = R1;	
	R1 = 0x0000;				    //延时计数器清零
	[G_DelayCounter] = R1;	
L_DelayLoop:
    R1 = 0x0001;                    //清看门狗
    [P_Watchdog_Clear]=R1;	
	R1 = [G_DelayCounter];			
	R1 += 1;						
	[G_DelayCounter] = R1;		
	JNZ  L_DelayLoop;				 //延时
    jmp	L_MainLoop;	
.END
    	
//*****************************************************************************/
//  main.asm 结束
//*****************************************************************************/	